# Taps
tap "homebrew/bundle"

# === Shell ===
brew "fish"
brew "starship"

# === Development Tools ===
brew "mise"
brew "uv"
brew "gh"

# === Modern CLI Tools ===
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "git-delta"
brew "jq"
brew "yq"
brew "httpie"

# === Applications ===
cask "visual-studio-code"
cask "warp"
cask "docker"
cask "1password"
cask "google-chrome"
cask "slack"
cask "notion"

# === Fonts ===
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
