# === Shell ===
brew "fish"
brew "starship"

# === Development Tools ===
brew "mise"
brew "uv"
brew "gh"
brew "biome"  # Fast formatter/linter for JS/TS/JSON/CSS/HTML

# === Modern CLI Tools ===
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "git-delta"
brew "jq"
brew "yq"
brew "httpie"
brew "tree"
brew "ghq"
brew "atuin"  # Shell history with SQLite, sync, and search

# === File Manager ===
brew "yazi"              # TUI file manager
brew "ffmpegthumbnailer" # Video thumbnails for yazi
brew "unar"              # Archive preview for yazi
brew "poppler"           # PDF preview for yazi
brew "imagemagick"       # Image processing for yazi

# === Terminal ===
cask "ghostty"

# === Applications ===
cask "visual-studio-code"
cask "docker-desktop"
cask "1password"
cask "google-chrome"
cask "slack"
cask "notion"
cask "raindropio"
cask "raycast"
cask "maccy"

# === Fonts ===
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
